# Data  frame part 2

In [3]:
import  numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [11]:
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [15]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [16]:
booldf = df>0

In [17]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [18]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [19]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

# The easy way of conditionally selecting elements

In [21]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [24]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [27]:
df[df['Y']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
D -0.497104 -0.754070 -0.943406  0.484752

In [28]:
df[df['X']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [29]:
df[df['X']>0]['X']

A    1.693723
B    0.390528
C    0.072960
E    1.901755
Name: X, dtype: float64

In [32]:
df[df['X']>0][['W','X','Z']]

          W         X         Z
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
E -0.116773  1.901755  1.996652

# Multiple condition

In [39]:
df[(df['X']>0)and(df['Y']>0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

# For the above situation we need to use & instead of and operator

In [38]:
df[(df['X']>0)&(df['Y']<1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

# index resting to make them permanet just set inplce to True

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [42]:
newind ='NY CA WY OR CO'.split()

In [43]:
newind

['NY', 'CA', 'WY', 'OR', 'CO']

In [45]:
df['states']= newind

In [46]:
df

          W         X         Y         Z states
A  0.302665  1.693723 -1.706086 -1.159119     NY
B -0.134841  0.390528  0.166905  0.184502     CA
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [47]:
df.set_index('states')

               W         X         Y         Z
states
NY      0.302665  1.693723 -1.706086 -1.159119
CA     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652